In [1]:
# 필요한 변수 컬럼만 추출하기

In [16]:
# Pnadas 패키지를 로드함
# exam.csv를 데이터 프레임 exam으로 읽어들임
import pandas as pd
exam = pd.read_csv('exam.csv')
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [5]:
# math 변수만 추출(시리즈)
exam['math'].head()

0    50
1    60
2    45
3    30
4    25
Name: math, dtype: int64

In [7]:
# math 변수만 데이터 프레임으로 추출
exam[['math']].head()

   math
0    50
1    60
2    45
3    30
4    25

In [9]:
# nclass, math, english 변수만 데이터 프레임으로 추출
exam[['nclass', 'math', 'english']].head()

   nclass  math  english
0       1    50       98
1       1    60       97
2       1    45       86
3       1    30       98
4       2    25       80

In [10]:
# 변수 제거하기
# df.drop(columns = '컬럼이름')

In [11]:
# 변수(컬럼) math 제거
#(주의) math 가 제거된 테이블이 반환되어 출력됨 - 원래 데이터프레임은 변경 없음
exam.drop(columns = 'math').head()

   id  nclass  english  science
0   1       1       98       50
1   2       1       97       60
2   3       1       86       78
3   4       1       98       58
4   5       2       80       65

In [18]:
#(주의) math 가 제거된 테이블이 반환되어 출력됨 - 원래 데이터프레임은 변경 없음
# 데이터 프레임에서 아예 삭제가 된다. 
exam.drop(columns = 'math', inplace=True)

In [17]:
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65